In [1]:
# dictionaries

dict_1 = {'Person 1':'William',
          'Person 2':'Bosser'}

dict_2 = {'William':'teal',
          'Andy':'purple'}

wills_col = dict_2['William']
print(wills_col)

teal

In [2]:
num_list = [1,3,6,2,6,4,7,8,3,6]
print(num_list)

num_list.sort()
print(num_list)

num_list.reverse()
print(num_list)

num_list = [1,3,6,2,6,4,7,8,3,6]
num_list.sort(reverse=True)
print(num_list)

[1, 3, 6, 2, 6, 4, 7, 8, 3, 6]
[1, 2, 3, 3, 4, 6, 6, 6, 7, 8]
[8, 7, 6, 6, 6, 4, 3, 3, 2, 1]
[8, 7, 6, 6, 6, 4, 3, 3, 2, 1]

In [3]:
import pandas as pd

filepath = 'https://raw.githubusercontent.com/data-to-insight/csc-validator-be-903/main/tests/fake_data/header.csv'

header_903 = pd.read_csv(filepath)
print(header_903) # this is called a dataframe

       CHILD  SEX         DOB ETHNIC            UPN  MOTHER MC_DOB
0     566910    2  27/03/2008   WROM  D051910639385     NaN    NaN
1     384923    2  09/09/2011   REFU  L034811502612     NaN    NaN
2     709901    1  14/02/2013   ABAN  Y021751958510     NaN    NaN
3     550084    2  04/05/2008   AOTH  R095578985099     NaN    NaN
4     710229    2  15/04/2002   REFU  Z095096287583     NaN    NaN
...      ...  ...         ...    ...            ...     ...    ...
2670  152113    1  06/06/2003   WBRI  K096794376750     NaN    NaN
2671  481370    2  12/02/2008   BAFR  C014150452081     NaN    NaN
2672  791577    1  28/05/2011   WBRI  Q009369089812     NaN    NaN
2673  238470    1  21/11/2013   AIND  P095222532769     NaN    NaN
2674  437361    1  15/12/2012   WROM  G018001328504     NaN    NaN

[2675 rows x 7 columns]

In [10]:
dict_of_list = {'column 1':[1,2,3],
                'column 2':['foo','bar','baz'],
                'column 3':['A','B','C']}
# print(dict_of_list)


df_1 = pd.DataFrame(dict_of_list) # df for a dataframe
print(df_1)
print(df_1['column 2'])
# the first column is the row index

   column 1 column 2 column 3
0         1      foo        A
1         2      bar        B
2         3      baz        C
0    foo
1    bar
2    baz
Name: column 2, dtype: object

In [11]:
list_of_dicts = [{'col 1':1,
                  'col 2':'foo',
                  'col 3':'A'},
                  {'col 1':2,
                  'col 2':'bar',
                  'col 3':'B'},
                  {'col 1':3,
                  'col 2':'baz',
                  'col 3':'C'}]
df_2 = pd.DataFrame(list_of_dicts)
print(df_2)

   col 1 col 2 col 3
0      1   foo     A
1      2   bar     B
2      3   baz     C

In [20]:
# exercise
list_of_jobs = {'name':['Bob','Joe','Kyle','Harry'],
                'salary':[34000,45000,29000,12000],
                'job title':['just Bob','Director','handyman','bag dropper']}
df_jobs = pd.DataFrame(list_of_jobs)
print(df_jobs)
print(type(df_jobs['salary']))

# or the 2 steps above (first a variable, then pd dataframe) in one below:
staff_df = pd.DataFrame({'name':['Bob','Joe','Kyle','Harry'],
                'salary':[34000,45000,29000,12000],
                'job title':['just Bob','Director','handyman','bag dropper']})
print(staff_df)

    name  salary    job title
0    Bob   34000     just Bob
1    Joe   45000     Director
2   Kyle   29000     handyman
3  Harry   12000  bag dropper
<class 'pandas.core.series.Series'>
    name  salary    job title
0    Bob   34000     just Bob
1    Joe   45000     Director
2   Kyle   29000     handyman
3  Harry   12000  bag dropper

In [16]:
print(staff_df.info()) # print info about the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       4 non-null      object
 1   salary     4 non-null      int64
 2   job title  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes
None

In [18]:
print(header_903.head()) # print first n rows, if empty then 5 is the default value
print(header_903.head(20))

    CHILD  SEX         DOB ETHNIC            UPN  MOTHER MC_DOB
0  566910    2  27/03/2008   WROM  D051910639385     NaN    NaN
1  384923    2  09/09/2011   REFU  L034811502612     NaN    NaN
2  709901    1  14/02/2013   ABAN  Y021751958510     NaN    NaN
3  550084    2  04/05/2008   AOTH  R095578985099     NaN    NaN
4  710229    2  15/04/2002   REFU  Z095096287583     NaN    NaN
     CHILD  SEX         DOB ETHNIC            UPN  MOTHER MC_DOB
0   566910    2  27/03/2008   WROM  D051910639385     NaN    NaN
1   384923    2  09/09/2011   REFU  L034811502612     NaN    NaN
2   709901    1  14/02/2013   ABAN  Y021751958510     NaN    NaN
3   550084    2  04/05/2008   AOTH  R095578985099     NaN    NaN
4   710229    2  15/04/2002   REFU  Z095096287583     NaN    NaN
5   733831    1  06/07/2013   WROM  Z005227500041     NaN    NaN
6    69112    2  11/09/2010   ABAN  X089575916879     NaN    NaN
7   853884    2  09/10/2004   WBRI  U096513817313     NaN    NaN
8   634852    2  19/10/2006   WIRI  X019131453866     NaN    NaN
9   512087    1  01/10/2003   MOTH  J091207487052     NaN    NaN
10  503696    2  15/01/2003   WIRI  H027736847316     NaN    NaN
11  427922    2  19/01/2004   AOTH  Q044775492446     NaN    NaN
12  411080    1  30/07/2011   NOBT  O068405655286     NaN    NaN
13  231934    2  09/06/2003   WIRT  T004199988970     NaN    NaN
14  476797    2  04/10/2007   MWBA  R083882967327     NaN    NaN
15  102639    2  18/10/2010   MWAS  U055364892356     NaN    NaN
16  686826    2  14/12/2007   APKN  K004096761894     NaN    NaN
17   50224    1  11/01/2003   REFU  U055331591206     NaN    NaN
18  854701    2  12/03/2012   BOTH  A086440327879     NaN    NaN
19  347997    2  11/03/2008   WBRI  N093608999332     NaN    NaN

In [19]:
print(header_903['ETHNIC'].unique())

['WROM' 'REFU' 'ABAN' 'AOTH' 'WBRI' 'WIRI' 'MOTH' 'NOBT' 'WIRT' 'MWBA'
 'MWAS' 'APKN' 'BOTH' 'OOTH' 'WOTH' 'BCRB' 'MWBC' 'AIND' 'CHNE' 'BAFR']

In [23]:
salary_sum = staff_df['salary'].sum()
print(salary_sum)

salary_mean = staff_df['salary'].mean()
salary_min = staff_df['salary'].min() # also .max()
print(f'The mean salary is {salary_mean}, the min salary is {salary_min}.')

120000
The mean salary is 30000.0, the min salary is 12000.